machine-learning/notes.org
#+LATEX_HEADER_EXTRA: \usepackage{amsmath}
* Week 1
** Intro
A computer is said to learn from experience E with respect to task T,
and some performance measure P, if its performance on T as measured by
P improves with experience E.

** Supervised Learning
- Example problem given a dataset of houses where price is on the X
  axis and sq. ft is on the Y axis, predict the price for a given
  square footage.

- You input is a data set with the "right" answers. The task is to
  produce more of the "right" answers. Since you are trying to predict
  a continuous value this is called a regression problem.

- Knowing the best function to fit to your data is something you gain intuition for?

- Classification problem: discrete output (0, 1, 2)
- Regression problem: continuous output (0 - 2)

- Support vector machines are a thing and they allow a computer to
  deal with an infinite number of features.

** Unsupervised Learning
- We are given data that has few or no labels and the goal is to find
  some structure in the data

- Google News is an example of this clustering by un-labeled topic,
  you don't know what the stories will be about in advanced

- You don't know in advance any of the labels and you want the machine to label things for you

- analyzing communications between computers in data center and
  optimizing topology for clusters that frequency work together

- applications of unsupervised learning:
  - clustering
  - separating voices out at a cocktail party ("cocktail party" algorithm) e.g. signal correlation

** Model and Cost Function
Notation:
- input variables are often called features
- (x,y) is a single training example
- (x^i, y^i) the ith training example
- the function that a learning algorithm produces is often called a hypothesis
- training set -> learning algorithm -> h()
  - h is a function that maps from x's to y's
- Linear regression with one variable AKA Univarite linear regression

- Hypothesis :: \(h_{\theta}(x) = \theta_{0} + \theta_{1}x\)
- Parameters :: \(\theta_{0},\theta_{01}\)
- Cost function :: \(J(\theta_{0},\theta_{1}) = \frac{1}{2m}\sum\limits_{i=1}^{m}(h_{\theta}(x^{(i)})-y^{(i)})^2\)
- Goal :: minimize \(J(\theta_{0},\theta_{1})\)
- This cost function is called the "squared error" or "mean squared
  error" function and works well for a lot of linear regression
  problems
- You can get better intuition around the goal by simplifying to one
  parameter \(\theta_{1}\) graphing \(h_{\theta}(x)\) with some inputs
  you'll notice that the corresponding cost function graph for
  \(\theta_{1}\) is a parabola converging on \(\theta_{1} = 1\).
- The best possible line will be such so that the average squared
  vertical distances of the scattered points from the line will be the
  least. Ideally, the line should pass through all the points of our
  training data set. In such a case, the value of J(θ0,θ1) will be 0
- two parameters can be visualized on a 3D graph or in two dimensions
  via a contour plot. We put θ0 on the x axis and θ1 on the y axis,
  with the cost function on the vertical z axis.

** Gradient Descent Algorithm
- the gradient descent algorithm can help minimize functions and is
  used in many machine learning techniques in our case this is
  \(\overset{min}{\theta_{0},\theta_{1}}J(\theta_{0},\theta_{1})\)
- start with some values for \(\theta_{0}, \theta_{1})\ (zero is common default value)
- keep changing \(\theta_{0}, \theta_{1})\ to reduce
  \(J(\theta_{0},\theta_{1})\) until you end up at a minimum
  (hopefully)
- repeat until convergence :: \(\theta_{j}:=\theta_{j}-\alpha\frac{\partial}{\partial\theta_{j}}J(\theta_{0},\theta_{1})}\)
- assignment operator :: \(:=\)
- learning rate :: \(\alpha\), controls how big of a step you take on the descent
- derivative term :: \(\alpha\frac{\partial}{\partial\theta_{j}}J(\theta_{0},\theta_{1})\)
- *\(\theta_{0}\) and \(\theta_{1}\) should be updated simultaneously
  as they have inputs dependant on one another
- at the local optimum your derivative is zero so \(\theta_{1}\) is unchanged
- with a fixed learning rate \(\alpha\) each successive step is
  smaller because the derivative slope value is smaller
*** intuition
- simplify to 1 feature :: \(\theta_{1}:=\theta_{1}-\alpha\frac{d}{d\theta_{j}}J(\theta_{1})}\)
- graph a convex function and pick a point on that line
- the derivative is the slope of the line that is tagent to the function
- if the point we picked has a positive slope we get \(\theta_{1}:=\theta_{1}-\alpha(positive number)\) which helps us move closer to the minimum
- if the point we picked has a negative slope we get \(\theta_{1}:=\theta_{1}-\alpha(negative number)\) which helps us move closer to the minimum
*** pitfalls
- if \(\alpha\) is too small than gradient descent can be slow
- if \(\alpha\) is too big than you can overshoot the minimum and not converge
** Putting it all together
- we find the best linear fit to the data by finding the slope and
  offset values that minimize the cost function
- the cost function for linear regression is always going to be a
  bow-shaped or "convex" function, so there is only one global optimum (no local optimum)
- "batch" gradient descent means we are using all the training examples in every step of gradient descent (each update sum's examples)
- there are other versions of gradient descent that window data sets
- linear regression model :: \(h_{\theta}(x)=\theta_{0}+\theta_{1}x
- cost function :: \(J(\theta_{0},\theta_{1}) = \frac{1}{2m}\sum\limits_{i=1}^{m}(h_{\theta}(x^{(i)})-y^{(i)})^2\)
- gradient descent algorithm :: \(\theta_{j}:=\theta_{j}-\alpha\frac{\partial}{\partial\theta_{j}}J(\theta_{0},\theta_{1})} (for j=1 and j=0)\)
- we find the best linear fit to the data by finding the slope and
  offset values that minimize the cost function
*** calculating the partial derivative
- expand equation
  - \(\frac{\partial}{\partial\theta_{j}}J(\theta_{0},\theta_{1}) = \frac{\partial}{\partial\theta_{j}}*\frac{1}{2m}\sum\limits_{i=1}^{m}(h_{\theta}(x^{(i)})-y^{(i)})^2\)
  - \(\frac{\partial}{\partial\theta_{j}}*\frac{1}{2m}\sum\limits_{i=1}^{m}(h_{\theta}(x^{(i)})-y^{(i)})^2 = \(\frac{\partial}{\partial\theta_{j}}*\frac{1}{2m}\sum\limits_{i=1}^{m}(\theta_{0}+\theta_{1}x^{(i)}-y^{(i)})^2 \)
- figure out partial derivative for \(j=0\) and \(j=1\)
  - \(j = 0 : \frac{\partial}{\partial\theta_{0}}J(\theta_{0},\theta_{1}) = \frac{1}{m}\sum\limits_{i=1}^{m}(h_{\theta}(x^{(i)})-y^{(i)})\) \)
  - \(j = 1 : \frac{\partial}{\partial\theta_{1}}J(\theta_{0},\theta_{1}) = \frac{1}{m}\sum\limits_{i=1}^{m}(h_{\theta}(x^{(i)})-y^{(i)})*x^{(i)}\) \)
  - @todo calculate these derivations yourself
- plug into gradient descent (repeat until convergence, simultaneously update assignments)
  - \(\theta_{0}:=\theta_{0}-\alpha\frac{1}{m}\sum\limits_{i=1}^{m}(h_{\theta}(x^{(i)})-y^{(i)})\) \)
  - \(\theta_{1}:=\theta_{1}-\alpha\frac{1}{m}\sum\limits_{i=1}^{m}(h_{\theta}(x^{(i)})-y^{(i)})*x^{(i)}\) \)
