machine-learning/notes.tex
% Created 2017-08-18 Fri 17:06
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{amsmath}
\author{Mackenzie Starr}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Mackenzie Starr},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 24.5.1 (Org mode 9.0.5)},
 pdflang={English}}
\begin{document}

\tableofcontents

\section{Week 1}
\label{sec:org6848b85}
\subsection{Intro}
\label{sec:org70aeddf}
A computer is said to learn from experience E with respect to task T,
and some performance measure P, if its performance on T as measured by
P improves with experience E.

\subsection{Supervised Learning}
\label{sec:org836dc09}
\begin{itemize}
\item Example problem given a dataset of houses where price is on the X
axis and sq. ft is on the Y axis, predict the price for a given
square footage.

\item You input is a data set with the "right" answers. The task is to
produce more of the "right" answers. Since you are trying to predict
a continuous value this is called a regression problem.

\item Knowing the best function to fit to your data is something you gain intuition for?

\item Classification problem: discrete output (0, 1, 2)
\item Regression problem: continuous output (0 - 2)

\item Support vector machines are a thing and they allow a computer to
deal with an infinite number of features.
\end{itemize}

\subsection{Unsupervised Learning}
\label{sec:orgbcc7906}
\begin{itemize}
\item We are given data that has few or no labels and the goal is to find
some structure in the data

\item Google News is an example of this clustering by un-labeled topic,
you don't know what the stories will be about in advanced

\item You don't know in advance any of the labels and you want the machine to label things for you

\item analyzing communications between computers in data center and
optimizing topology for clusters that frequency work together

\item applications of unsupervised learning:
\begin{itemize}
\item clustering
\item separating voices out at a cocktail party ("cocktail party" algorithm) e.g. signal correlation
\end{itemize}
\end{itemize}

\subsection{Model and Cost Function}
\label{sec:org4e0261a}
Notation:
\begin{itemize}
\item input variables are often called features
\item (x,y) is a single training example
\item (x\(^{\text{i}}\), y\(^{\text{i}}\)) the ith training example
\item the function that a learning algorithm produces is often called a hypothesis
\item training set -> learning algorithm -> h()
\begin{itemize}
\item h is a function that maps from x's to y's
\end{itemize}
\item Linear regression with one variable AKA Univarite linear regression

\item[{Hypothesis}] \(h_{\theta}(x) = \theta_{0} + \theta_{1}x\)
\item[{Parameters}] \(\theta_{0},\theta_{01}\)
\item[{Cost function}] \(J(\theta_{0},\theta_{1}) = \frac{1}{2m}\sum\limits_{i=1}^{m}(h_{\theta}(x^{(i)})-y^{(i)})^2\)
\item[{Goal}] minimize \(J(\theta_{0},\theta_{1})\)
\item This cost function is called the "squared error" or "mean squared
error" function and works well for a lot of linear regression
problems
\item You can get better intuition around the goal by simplifying to one
parameter \(\theta_{1}\) graphing \(h_{\theta}(x)\) with some inputs
you'll notice that the corresponding cost function graph for
\(\theta_{1}\) is a parabola converging on \(\theta_{1} = 1\).
\item The best possible line will be such so that the average squared
vertical distances of the scattered points from the line will be the
least. Ideally, the line should pass through all the points of our
training data set. In such a case, the value of J(θ0,θ1) will be 0
\item two parameters can be visualized on a 3D graph or in two dimensions
via a contour plot. We put θ0 on the x axis and θ1 on the y axis,
with the cost function on the vertical z axis.
\end{itemize}

\subsection{Gradient Descent Algorithm}
\label{sec:org49051a4}
\begin{itemize}
\item the gradient descent algorithm can help minimize functions and is
used in many machine learning techniques in our case this is
\(\overset{min}{\theta_{0},\theta_{1}}J(\theta_{0},\theta_{1})\)
\item start with some values for $\backslash$(\(\theta_{\text{0}}\), \(\theta_{\text{1}}\))$\backslash$ (zero is common default value)
\item keep changing \(\theta_{0}, \theta_{1})\ to reduce
  \(J(\theta_{0},\theta_{1})\) until you end up at a minimum
(hopefully)
\item[{repeat until convergence}] \(\theta_{j}:=\theta_{j}-\alpha\frac{\partial}{\partial\theta_{j}}J(\theta_{0},\theta_{1})}\)
\item[{assignment operator}] \(:=\)
\item[{learning rate}] \(\alpha\), controls how big of a step you take on the descent
\item[{derivative term}] \(\alpha\frac{\partial}{\partial\theta_{j}}J(\theta_{0},\theta_{1})\)
\item *\(\theta_{0}\) and \(\theta_{1}\) should be updated simultaneously
as they have inputs dependant on one another
\item at the local optimum your derivative is zero so \(\theta_{1}\) is unchanged
\item with a fixed learning rate \(\alpha\) each successive step is
smaller because the derivative slope value is smaller
\end{itemize}
\subsubsection{intuition}
\label{sec:orgdbcd8ba}
\begin{description}
\item[{simplify to 1 feature}] \(\theta_{1}:=\theta_{1}-\alpha\frac{d}{d\theta_{j}}J(\theta_{1})}\)
\item graph a convex function and pick a point on that line
\item the derivative is the slope of the line that is tagent to the function
\item if the point we picked has a positive slope we get \(\theta_{1}:=\theta_{1}-\alpha(positive number)\) which helps us move closer to the minimum
\item if the point we picked has a negative slope we get \(\theta_{1}:=\theta_{1}-\alpha(negative number)\) which helps us move closer to the minimum
\end{description}
\subsubsection{pitfalls}
\label{sec:org7d0726e}
\begin{itemize}
\item if \(\alpha\) is too small than gradient descent can be slow
\item if \(\alpha\) is too big than you can overshoot the minimum and not converge
\end{itemize}
\subsection{Putting it all together}
\label{sec:orgf2adb8e}
\begin{itemize}
\item we find the best linear fit to the data by finding the slope and
offset values that minimize the cost function
\item the cost function for linear regression is always going to be a
bow-shaped or "convex" function, so there is only one global optimum (no local optimum)
\item "batch" gradient descent means we are using all the training examples in every step of gradient descent (each update sum's examples)
\item there are other versions of gradient descent that window data sets
\item[{linear regression model}] $\backslash$(h\(_{\theta}\)(x)=\(\theta_{\text{0}}\)+\(\theta_{\text{1}}\)x
\item[{cost function}] \(J(\theta_{0},\theta_{1}) = \frac{1}{2m}\sum\limits_{i=1}^{m}(h_{\theta}(x^{(i)})-y^{(i)})^2\)
\item[{gradient descent algorithm}] \(\theta_{j}:=\theta_{j}-\alpha\frac{\partial}{\partial\theta_{j}}J(\theta_{0},\theta_{1})} (for j=1 and j=0)\)
\item we find the best linear fit to the data by finding the slope and
offset values that minimize the cost function
\end{itemize}
\subsubsection{calculating the partial derivative}
\label{sec:org33c7484}
\begin{itemize}
\item expand equation
\begin{itemize}
\item \(\frac{\partial}{\partial\theta_{j}}J(\theta_{0},\theta_{1}) = \frac{\partial}{\partial\theta_{j}}*\frac{1}{2m}\sum\limits_{i=1}^{m}(h_{\theta}(x^{(i)})-y^{(i)})^2\)
\item \(\frac{\partial}{\partial\theta_{j}}*\frac{1}{2m}\sum\limits_{i=1}^{m}(h_{\theta}(x^{(i)})-y^{(i)})^2 = \(\frac{\partial}{\partial\theta_{j}}*\frac{1}{2m}\sum\limits_{i=1}^{m}(\theta_{0}+\theta_{1}x^{(i)}-y^{(i)})^2\)
\end{itemize}
\item figure out partial derivative for \(j=0\) and \(j=1\)
\begin{itemize}
\item \(j = 0 : \frac{\partial}{\partial\theta_{0}}J(\theta_{0},\theta_{1}) = \frac{1}{m}\sum\limits_{i=1}^{m}(h_{\theta}(x^{(i)})-y^{(i)})\) $\backslash$)
\item \(j = 1 : \frac{\partial}{\partial\theta_{1}}J(\theta_{0},\theta_{1}) = \frac{1}{m}\sum\limits_{i=1}^{m}(h_{\theta}(x^{(i)})-y^{(i)})*x^{(i)}\) $\backslash$)
\item @todo calculate these derivations yourself
\end{itemize}
\item plug into gradient descent (repeat until convergence, simultaneously update assignments)
\begin{itemize}
\item \(\theta_{0}:=\theta_{0}-\alpha\frac{1}{m}\sum\limits_{i=1}^{m}(h_{\theta}(x^{(i)})-y^{(i)})\) $\backslash$)
\item \(\theta_{1}:=\theta_{1}-\alpha\frac{1}{m}\sum\limits_{i=1}^{m}(h_{\theta}(x^{(i)})-y^{(i)})*x^{(i)}\) $\backslash$)
\end{itemize}
\end{itemize}
