machine-learning/notes.tex
\subsection{Linear Algebra Review}
\label{sec:orgd51db55}
\begin{description}
\item[{matrix}] rectangular array of values, dimension is determined by rows x columns
\item matrices of a specific dimension containing real number are often
notated like this: \mathbb{R}\(^{\text{4x2}}\)
\item to refer to specific elements matrix \(A\) you can use the notation
\(A_{ij}\) to meant the \(i\)th row, \(j\)th column
\item[{vector}] a nx1 matrix, notated as \(\mathbb{R}^{4}\), values
accessed as \(A_{i}\), a 4-dimensional vector has 4
elements
\item in mathematical notation 1-indexed notation is preferred
\item lowercase variables often denote vectors and uppercase variables denote matrices
\end{description}
\subsubsection{Addition and Scalar Multiplication}
\label{sec:org8116229}
\begin{itemize}
\item matrices of the same dimensions add in a straightforward way
\begin{itemize}
\item \(\begin{bmatrix}1 & 2 \\ 3 & 4 \\ 5 & 6 \end{bmatrix} + \begin{bmatrix}1 & 2 \\ 3 & 4 \\ 5 & 6 \end{bmatrix} = \begin{bmatrix}2 & 4 \\ 6 & 8 \\ 10 & 12 \end{bmatrix}\)
\end{itemize}
\item matrices of different dimensions cannot be added
\begin{itemize}
\item \(\begin{bmatrix}1 & 2 \\ 3 & 4 \\ 5 & 6\end{bmatrix} + \begin{bmatrix}1 & 2 \\ 3 & 4\end{bmatrix} = undefined\)
\end{itemize}
\item $\backslash$(3\(\cdot\)\begin{bmatrix}1 \& 2 $\backslash$\ 3 \& 4 \end{bmatrix} produces a matrix of the same dimension where each value is the product of the previous value and 3
\item scalar division works in a similar way
\end{itemize}
\subsubsection{Matrix Vector Multiplication}
\label{sec:org3675250}
\begin{itemize}
\item multiplying a m x n matrix with a vector is done calculating the dot
product of each matrix row with the vector, yeilding a m-dimensional
vector
\end{itemize}
\subsubsection{Matrix Matrix Multiplication}
\label{sec:org475d5f4}
\begin{itemize}
\item for matrix-matrix multiplication you break the second term into
vectors and then combine the columns at the end. a MxN matrix
multipled by a NxO matrix yields a MxO matrix. The N must match in
order to be able to multiply them
\item The ith column of matrix C is obtained by multiplying A with the ith column of B
\item To multiply two matrices, the number of columns of the first matrix must equal the number of rows of the second matrix.
\end{itemize}
\subsubsection{Matrix Multiplication Properties}
\label{sec:orgcae5b2e}
\begin{itemize}
\item regular multiplication is commutative, matrix multiplication is not (A x B is not equal to B x A)
\item regular multiplication is associative and so is matrix multiplication
\item for the identity matrix AB is equal to AB
\end{itemize}
\subsubsection{Matrix inverse and matrix transpose operation}
\label{sec:org50ef47b}
\begin{itemize}
\item if \(A\) is an \(mxm\) (square) matrix and has an inverse: \(AA^{-1}=A^{-1}A=I\)
\item some \(mxm\) matrices don't have an inverse (e.g. all values are zero)
\item singular or degenerate matrices are matrices that don't have an inverse
\end{itemize}

\section{Week 2}
\label{sec:orgff97949}
\subsection{Multivariant Linear Regression}
\label{sec:orgd0a0d0d}
\subsubsection{Notation}
\label{sec:org8607cd0}
\begin{description}
\item[{\(n\)}] number of features
\item[{\(m\)}] number of training examples
\item[{\(x^{(i)}\)}] input of the \(i^{th}\) training example
\item[{\(x_{j}^{(i)}\)}] value of feature \(j\) in \(i^{th}\) training example
\end{description}
\subsubsection{Hypothesis}
\label{sec:org6109f37}
\begin{itemize}
\item previously with univariant linear regression our hypothesis was
\(h_{\theta}(x)=\theta_{0}+\theta_{1}x\)
\item for multivariant we have a polynomial hypothesis \(h_{\theta}(x)=\theta_{0}+\theta_{1}x_{1}+\theta_{2}x_{2}+...+\theta_{n}x_{n}\)
\item if you define \(x_{0}^{(i)} = 1\) than you can normalize the above as
\(h_{\theta}(x)=\theta_{0}x_{0}+\theta_{1}x_{1}+\theta_{2}x_{2}+...+\theta_{n}x_{n}\)
express in matrix multiplication as \(h_{\theta}(x)=\theta^{T}x\)
\item \(\theta^{T}x=\begin{bmatrix}\theta_{0} & \theta_{1} & ... & \theta_{n}\end{bmatrix}\begin{bmatrix}x_{0} \\ x_{1} \\ ... \\ x_{n} \end{bmatrix}=h_{\theta}(x)\)
\end{itemize}
\subsubsection{Gradient descent for multiple variables}
\label{sec:orgbbcedaa}
\begin{itemize}
\item the cost function is again \frac{1}{2m}\(\sum\)\limits\(_{\text{i=1}}^{\text{m}}\)(h\(_{\theta}\)(x\(^{\text{(i)}}\))-y\(^{\text{(i)}}\))\(^{\text{2}}\)$\backslash$) but \(h_{\theta}(x^{(i)})=\theta^{T}(x^{i})\)
\item in the gradient descent formula the \(x\) in the derivative term has
to be altered slightly to account for more than one feature
\(\theta_{j}:=\theta_{j}-\alpha\frac{1}{m}\sum\limits_{i=1}^{m}(h_{\theta}(x^{(i)})-y^{(i)})*x_{j}^{(i)}\)
\item @todo understand this more
\end{itemize}
\subsubsection{Feature scaling \& Mean normalization}
\label{sec:orga238f5f}
\begin{description}
\item[{why?}] if you ensure your features have similar ranges of values than
gradient descent with converge quicker
\item conventionally things are usually scaled \(-1\leq0\leq1\) but having
a similar range \(max-min\) across features is most important, not
the specific high and low value
\item feature scaling is dividing the input values by the range to get a range of 1
\item mean normalization is a technique for getting the average value of 0 for a feature
\item[{combining mean normalization \& feature scaling}] \(x_{i}:=\frac{x_{i}-\mu_{i}}{s_{i}}\)
where \(\mu_{i}\) is average value of x in training set and \(s_{i}\) is the range \(max-min\) (or standard deviation)
\item @todo what is standard deviation
\end{description}
\subsubsection{Learning Rate}
\label{sec:org66109eb}
\begin{itemize}
\item to make sure gradient descent is working correctly you can plot the
the cost function over the number iterations and the cost function
should go down as iterations go up
\item you can also automate the above by defining a threshold in code but
that can be tricky
\item if your cost function value is increasing over the number of
iterations or has a scalloped pattern than you learning rate is
probably too large
\item to choose a proper \(\alpha\) value plot \(J(\theta)\) with different successively larger learning rates \(.001, .003, .01, .03, .1, .3, 1, 3\)
\end{itemize}
\subsubsection{Features \& Polynomial Regression}
\label{sec:orgb36163d}
\begin{description}
\item[{housing prices prediction}] \(h_{\theta}(x)=\theta_{0}+\theta_{1}\cdot frontage + \theta_{2} \cdot depth\)
\item instead of working with the simple features you have, you free to create your own compound features (e.g. \(area\) is a compound feature of \(frontage\cdotdepth\))
\item[{housing prices prediction with compound feature}] \(h_{\theta}(x)=\theta_{0}+\theta_{1}area\)
\item say we wanted had a hypothesis that a cubic function was a good fit
to our data
\(h_{\theta}(x)=\theta_{0}+\theta_{1}x+\theta_{2}x^{2}+\theta_{3}x^{3}\),
the machinery of linear regression still works for this
\(h_{\theta}(x)=\theta_{0}+\theta_{1}x_{1}+\theta_{2}x_{2}+\theta_{3}x_{3}=\theta_{0}+\theta_{1}(size)+\theta_{2}(size)^{2}+\theta_{3}(size)^3\)
\item some algorithms can solve the \texttt{what features do i use?} question by
automatically choosing what features to use and what functions you
want to fit to that data
\end{description}
\subsection{Computing Parameters Analytics}
\label{sec:org42c4ad3}
\subsubsection{Normal Equation}
\label{sec:orge8ebee9}
\begin{itemize}
\item solves for optimal values of the parameters to  \J(\(\theta\)$\backslash$) in one step for some linear regression problems
\item there is no need to do feature scaling with the normal equation
\item \(\theta = (X^{T}X)^{-1}X^{T}y\) where \((X^{T}X)^{-1}\) is the inverse of the matrix \(X^{T}X\) gives you the optimal value for \(\theta\)
\end{itemize}
\begin{center}
\begin{tabular}{ll}
Gradient Descent & Normal Equation\\
\hline
needs to choose \(\alpha\) & no need to choose \(\alpha\)\\
needs many iterations & don't need to iterate\\
scales with large set of features & doesn't scale with large set of features (inverting a very large +10,000 matrix is expensive)\\
 & less versitile (doesn't work with logisitic regression)\\
\end{tabular}
\end{center}
\begin{enumerate}
\item Intuition
\label{sec:org2cc9971}
\begin{itemize}
