machine-learning/notes.org
**** Intuition
- in one-dimension given a scalar value for \(\theta\), and the quadratic function \(J(\theta)=a\theta^{2}+b\theta+c\)
- to minimize, take the derivative and set to 0, \(\frac{\partial}{\partial\theta}J(\theta)= ... = 0\) and solve for \(\theta\)
- in the multivariate version if you take the partial derivative of
  \(J\) with respect to every parameter if \theta_{j} and set that to
  \(0\) and solve for \(\theta_{0},...,\theta{n}\) than you can get
  all the values to minimize the cost function









**** computing this for Singular / Degenerate Matrices
- If \(X^{T}X\) is noninvertible, the common causes might be:
  - Redundant features, where two features are very closely related (i.e. they are linearly dependent)
  - Too many features (e.g. m ≤ n). In this case, delete some features or use "regularization" (to be explained in a later lesson).
Solutions to the above problems include deleting a feature that is linearly dependent with another or deleting one or more features when there are too many features.
- @todo what types of matrices are non-invertible?
* @todo
- replicate Solvvy,
- https://github.etsycorp.com/Engineering/Etsyweb/commit/0c6754d73fbae3b60310b2fdd1e9948f46e675de

- come up with basic ML project ideas
  - "cocktail party" algorithm is sweet, separates audio without any
    complicated audio processing libraries
- read more about mean squared error function
