machine-learning/notes.tex
\item in one-dimension given a scalar value for \(\theta\), and the quadratic function \(J(\theta)=a\theta^{2}+b\theta+c\)
\item to minimize, take the derivative and set to 0, \(\frac{\partial}{\partial\theta}J(\theta)= ... = 0\) and solve for \(\theta\)
\item in the multivariate version if you take the partial derivative of
\(J\) with respect to every parameter if \(\theta_{\text{j}}\) and set that to
\(0\) and solve for \(\theta_{0},...,\theta{n}\) than you can get
all the values to minimize the cost function
\end{itemize}









\item computing this for Singular / Degenerate Matrices
\label{sec:org2aa3245}
\begin{itemize}
\item If \(X^{T}X\) is noninvertible, the common causes might be:
\begin{itemize}
\item Redundant features, where two features are very closely related (i.e. they are linearly dependent)
\item Too many features (e.g. m ≤ n). In this case, delete some features or use "regularization" (to be explained in a later lesson).
\end{itemize}
\end{itemize}
Solutions to the above problems include deleting a feature that is linearly dependent with another or deleting one or more features when there are too many features.
\begin{itemize}
\item @todo what types of matrices are non-invertible?
\end{itemize}
\end{enumerate}
\section{@todo}
\label{sec:org0a89b6c}
\begin{itemize}
\item replicate Solvvy,
\item \url{https://github.etsycorp.com/Engineering/Etsyweb/commit/0c6754d73fbae3b60310b2fdd1e9948f46e675de}

\item come up with basic ML project ideas
\begin{itemize}
\item "cocktail party" algorithm is sweet, separates audio without any
complicated audio processing libraries
\end{itemize}
\item read more about mean squared error function
\end{itemize}
\end{document}
